<template>
    <v-container>
      <loading-overlay :loading="categorys_is_loading"></loading-overlay>
      <v-row>
        <v-col align="center">
          <img src="../../../assets/profile/policyAndrule.png" class="my-10" />
          <v-col>
            <div class="text-xl font-bold">
              <label>ข้อกำหนดการและเงื่อนไขการใช้บริการ</label>
            </div>
            <div class="text-md font-medium my-2">
              <label>Personal Data Protection Policy</label>
            </div>
            <div class="indent-8 text-left text-slate-400">
              บริษัท อินเทอร์เน็ตประเทศไทย จำกัด (มหาชน)
              มีความมุ่งมั่นที่จะดำเนินการตาม พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
              พ.ศ. 2562 ให้สอดคล้องกับหลักเกณฑ์
              ของคณะกรรมการคุ้มครองข้อมูลส่วนบุคคล
              เพื่อให้มีหลักเกณฑ์การคุ้มครองสิทธิ
              ของเจ้าของข้อมูลเกี่ยวกับข้อมูลส่วนบุคคลสิทธิในความเป็นส่วนตัวและเสรีภาพใน
              ข้อมูลส่วนบุคคลของผู้เจ้าของข้อมูล
              และพัฒนาปรับปรุงนโยบายระเบียบปฏิบัติของ บริษัทให้ต่อเนื่องสืบไป
              เพื่อให้เป็นไปตามนโยบายการคุ้มครองข้อมูลส่วนบุคคล
              บริษัทจึงขอประกาศนโยบาย ดังนี้
            </div>
            <div class="text-left my-8 text-slate-400">
              1. คำนิยาม
  “บริษัท” หมายถึง บริษัท อินเทอร์เน็ตประเทศไทย จำกัด (มหาชน)“บุคคล” ในที่นี้หมายถึง บุคคลธรรมดาที่มีชีวิตอยู่ ไม่รวมถึง “นิติบุคคล” ที่จัดตั้งขึ้นตามกฎหมาย“ข้อมูลส่วนบุคคล” หมายถึง ข้อมูลใดๆที่ระบุไปถึง “เจ้าของข้อมูล” (Data Subject) ได้ไม่ว่าทางตรงหรือทางอ้อม อาทิ ชื่อ นามสกุล ที่อยู่ หมายเลขโทรศัพท์ เลขประจำตัวประชาชน เลขหนังสือเดินทาง เป็นต้นทั้งนี้ ไม่รวมถึงข้อมูลดังต่อไปนี้ เช่น ข้อมูลสำหรับการติดต่อทางธุรกิจที่ไม่ได้ระบุถึงตัวบุคคล อาทิ ชื่อบริษัท ที่อยู่ของบริษัท เลขทะเบียนนิติบุคคลของบริษัท เช่น info@company.co.th เป็นต้น“ข้อมูลส่วนบุคคลอ่อนไหว” หมายถึง ข้อมูลที่เป็นเรื่องส่วนบุคคลโดยแท้ของบุคคล แต่มีความละเอียดอ่อนและอาจสุ่มเสี่ยงในการเลือกปฏิบัติอย่างไม่เป็นธรรม เช่น เชื้อชาติ เผ่าพันธุ์ เป็นต้น“เจ้าของข้อมูลส่วนบุคคล” (Data Subject) หมายถึง บุคคลที่ข้อมูลส่วนบุคคลนั้นระบุไปถึง ตัวบุคคลที่เป็นเจ้าของข้อมูลส่วนบุคคลนั้น แต่ไม่ใช่กรณีที่บุคคลมีความเป็นเจ้าของข้อมูล (Ownership) หรือเป็นผู้สร้างหรือเก็บรวบรวมข้อมูลนั้นเอง โดยเจ้าของข้อมูลส่วนบุคคลนี้จะหมายถึงบุคคลธรรมดาเท่านั้น และไม่รวมถึง “นิติบุคคล” (Juridical Person) ที่จัดตั้งขึ้นตามกฎหมาย เช่น บริษัท สมาคม มูลนิธิ หรือองค์กรอื่นใด“การประมวลผล” หมายถึง การดำเนินการใดๆ เกี่ยวกับการใช้ 
  อ่านต่อ... 
            </div>
          </v-col>
        </v-col>
      </v-row>
    </v-container>
  </template>
    
    <script>
  import { mapActions, mapGetters } from "vuex";
import loadingOverlay from "../../../components/loading/loadingOverlay.vue";
    export default {
      components: {
    loadingOverlay,
  },
    data: () => ({}),
    mounted() {
      this.$store.dispatch("NavberUserModules/changeTitleNavber", "ข้อกำหนด");
    },
    methods: {
      ...mapActions({}),
    },
    computed: {
      ...mapGetters({categorys_is_loading : "CategoryModules/getCategorysIsLoading"}),
    },
  };
  </script>
    
    <style>
  </style>