<template>
  <v-container>
    <p style="text-align:center"><u>ข้อกำหนดหลักเกี่ยวกับการบริการ แอปพลิเคชัน Smart School Management</u></p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; ในการ ลงชื่อเข้าใช้ด้วย One ID ก่อนเริ่มใช้งาน&nbsp;แอปพลิเคชัน Smart School Management&nbsp;นั้น ท่านได้อ่าน ทำความเข้าใจ และยอมรับข้อกำหนดหลักเกี่ยวกับการบริการของSmart School Management (&ldquo;ข้อกำหนดหลักเกี่ยวกับการบริการ&rdquo;) ที่ได้มีการระบุไว้ในข้อกำหนดหลักเกี่ยวกับการบริการนี้ ซึ่งข้อกำหนดเหล่านี้กำกับดูแลการใช้งานแอปพลิเคชัน Smart School Management ของท่าน โปรดอ่านข้อกำหนดหลักเกี่ยวกับการบริการ ด้วยความระมัดระวัง เนื่องจากข้อกำหนดเหล่านี้มีผลต่อสิทธิและภาระหน้าที่ของท่านเอง หากท่านไม่ยอมรับข้อกำหนดหลักเกี่ยวกับการบริการ โปรดยุติการใช้งานแอปพลิเคชัน Smart School Management</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<span style="font-size:14px"><strong>1. คำจำกัดความ</strong></span></p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &ldquo;บริษัทฯ&rdquo; หมายถึง บริษัท วัน อินโนเวทีฟ จำกัด&nbsp; ซึ่งเป็นผู้มีสิทธิ์ ให้บริการแอปพลิเคชัน Smart School Management นี้</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &ldquo;แอปพลิเคชัน&nbsp; Smart School Management&rdquo; หมายถึง แอปพลิเคชัน หรือเว็บไซต์ที่พัฒนาขึ้นเพื่อใช้เป็นเครื่องมือสำหรับการบริหารจัดการคอร์สเรียน ตั้งแต่ระบบรับสมัคร การชำระเงิน การบริหารจัดการการเรียนการสอนของทั้งครูและผู้เรียน ระบบการลาของครูผู้สอน รวมถึงการประเมินผลการเรียนของผู้เรียน</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &ldquo;บริการ&rdquo; หมายถึง&nbsp; ช่องทางในการระบบการบริหารจัดการคอร์สเรียน ตั้งแต่ระบบรับสมัคร การชำระเงิน การบริหารจัดการการเรียนการสอนของทั้งครูและผู้เรียน ระบบการลาของครูผู้สอน รวมถึงการประเมินผลการเรียน โดยผู้ใช้สามารถส่งคำสั่งผ่านแอปพลิเคชัน Smart School Management</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &ldquo;ผู้ให้บริการ&rdquo; หมายถึง โรงเรียนวรพัฒน์</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &ldquo;บัญชีผู้ใช้&rdquo; หมายถึง บัญชีออนไลน์ที่บริษัทฯ สร้างขึ้นสำหรับผู้ใช้ และผู้ให้บริการแต่ละรายในแอปพลิเคชัน Smart School Management เมื่อมีการลงทะเบียน โดยผู้ใช้สามารถส่งคำสั่งในการใช้บริการที่ผู้ให้บริการเป็นผู้ดำเนินการผ่านบัญชีดังกล่าวได้</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&ldquo;ผู้ใช้ หรือท่าน&rdquo; หมายถึง ผู้ใช้แอปพลิเคชันSmart School Management ที่ส่งคำสั่งในการใช้บริการให้กับ ผู้ให้บริการ</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<span style="font-size:14px"><strong>2. ข้อตกลง</strong></span></p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.1&nbsp; &nbsp; &nbsp;ผู้ใช้ยืนยันว่าได้บรรลุนิติภาวะ หรือได้รับความยินยอมจากผู้ปกครองให้ใช้แอปพลิเคชัน Smart School Management และบริการแล้ว</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.2&nbsp; &nbsp; &nbsp;ในการใช้แอปพลิเคชัน Smart School Management บริษัท ฯ อาจส่งข้อความ/การแจ้งเตือนซึ่งเป็นส่วนหนึ่งของการดำเนินธุรกิจปกติในการใช้งานแอปพลิเคชัน Smart School Management ของผู้ใช้ผ่านแอปพลิเคชัน Smart School Management</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.3&nbsp; &nbsp; &nbsp;ผู้ใช้เข้าใจและยอมรับว่าแอปพลิเคชัน Smart School Management ทำหน้าที่เพื่อใช้เป็นช่องทางในการ การบริหารจัดการคอร์สเรียน ตั้งแต่ระบบรับสมัคร การชำระเงิน การบริหารจัดการการเรียนการสอนของทั้งครูและผู้เรียน ระบบการลาของครูผู้สอน รวมถึงการประเมินผลการเรียน</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.4&nbsp; &nbsp; &nbsp;ผู้ใช้จะไม่ชักจูง โน้มน้าว หรือพยายามที่จะชักจูง หรือโน้มน้าวธุรกิจประเภทใด ๆ ของบริษัท ฯหรือเข้าไปแทรกแซงความสัมพันธ์ทางธุรกิจของบริษัท ฯ กับบุคคลหรือนิติบุคคลใด ๆ ที่ผู้ใช้มีความคุ้นเคย หรือส่งคำสั่งในการใช้บริการ ไม่ว่าจะเป็นผลโดยตรง หรือโดยอ้อมมาจากการใช้แอปพลิเคชัน Smart School Management ของผู้ใช้</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.5&nbsp; &nbsp; &nbsp;ในการใช้แอปพลิเคชัน Smart School Management นั้น ผู้ใช้ตกลงว่า</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.5.1&nbsp; &nbsp;ผู้ใช้จะใช้บริการเพื่อวัตถุประสงค์ที่ถูกต้องตามกฎหมายเท่านั้น</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.5.2&nbsp; &nbsp;ผู้ใช้จะใช้บริการเพื่อวัตถุประสงค์ตามที่มุ่งหมายไว้ให้ใช้เท่านั้น</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.5.3&nbsp; &nbsp;ผู้ใช้จะไม่ใช้แอปพลิเคชัน Smart School Management และ/หรือ บริการเพื่อวัตถุประสงค์ในการฉ้อโกง</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.5.4&nbsp; &nbsp;ผู้ใช้จะไม่ใช้แอปพลิเคชันSmart School Management และ/หรือ บริการเพื่อวัตถุประสงค์อื่นนอกเหนือจากการรับการบริการ</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.5.5&nbsp; &nbsp;ผู้ใช้จะไม่ทำให้เสียหายหรือขัดขวางซึ่งการทำงานของเครือข่ายของแอปพลิเคชัน Smart School Management และ/หรือ เครือข่ายของบริการ</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;2.6&nbsp; &nbsp; ในการใช้บริการนี้ ผู้ใช้ตกลงปฏิบัติตามข้อกำหนดหลักเกี่ยวกับการบริการทุกประการ โดยผู้ใช้รับประกันและยืนยันว่าข้อมูลที่ผู้ใช้ให้ไว้กับบริษัท ฯ เพื่อวัตถุประสงค์ในการใช้บริการนั้นเป็นความจริง ครบถ้วน เป็นปัจจุบัน และเป็นข้อมูลที่ถูกต้อง โดยบริษัท ฯ ไม่มีหน้าที่และความรับผิดชอบใด ๆ ไม่ว่าโดยตรงหรือโดยอ้อมในกรณีที่ข้อมูลที่ผู้ใช้ให้ไว้เป็นข้อมูลเท็จ ไม่เป็นปัจจุบัน ไม่ครบถ้วน หรือเป็นข้อมูลที่ไม่ถูกต้อง</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<strong><span style="font-size:14px">3. ข้อจำกัดความรับผิดในการรับประกัน</span></strong></p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;3.1&nbsp; &nbsp; บริษัท ฯ ไม่ให้คำรับรอง รับประกัน เงื่อนไข (ไม่ว่าโดยชัดแจ้งหรือโดยปริยาย) หรือค้ำประกันต่อความน่าเชื่อถือ ความปลอดภัย ความตรงต่อเวลา คุณภาพ ความเหมาะสม หรือสภาพพร้อมใช้งานของบริการใด ๆ แอปพลิเคชัน Smart School Management หรือ ซอฟต์แวร์ ทั้งบริษัท ฯ ไม่ให้คำรับรอง เงื่อนไข หรือรับประกัน ไม่ว่าโดยชัดแจ้งหรือโดยปริยายว่า (ก) การใช้บริการ หรือ แอปพลิเคชัน Smart School Management จะเป็นที่พึงพอใจ มีคุณภาพ มีความปลอดภัย ตรงต่อเวลา ไม่ถูกรบกวน หรือปราศจากข้อบกพร่องใด ๆ หรือสามารถทำงานร่วมกับอุปกรณ์ ซอฟต์แวร์ ระบบ หรือข้อมูลใด ๆ (ข) ข้อมูลต่าง ๆ จะมีความถูกต้อง หรือเชื่อถือได้</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;3.2&nbsp; &nbsp;บริษัท ฯ ไม่รับผิดชอบต่อบริการที่ล่าช้า การไม่ปฏิบัติหน้าที่ หรือการยกเลิกบริการอันเนื่องมาจากการที่ผู้ใช้ ให้ข้อมูลที่ไม่ถูกต้อง เช่น ชื่อของผู้รับ รายละเอียดการติดต่อ หรือ ที่อยู่ หรือผู้ใช้ไม่ยืนยันข้อมูล หรือผู้ให้บริการไม่สามารถติดต่อผู้ใช้ได้</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;3.3&nbsp; &nbsp; บริษัท ฯ ไม่ให้คำรับรอง และไม่รับประกันว่าแอปพลิเคชัน Smart School Management หรือซอฟต์แวร์ที่เกี่ยวข้องจะไม่มีความล่าช้า ความผิดพลาด ไวรัส หรือซอฟต์แวร์ที่เป็นอันตราย และไม่รับประกันว่าข้อมูล คุณลักษณะพิเศษ ฟังก์ชันการใช้งาน หรือข้อมูลอื่นใดที่นำเสนอบน หรือผ่านแอปพลิเคชัน Smart School Management หรือสื่ออื่นใดที่มีการอ้างถึงจะมีความถูกต้อง เป็นประโยชน์ หรือได้รับการแก้ไขให้ถูกต้องแล้ว อย่างไรก็ตาม&nbsp; บริษัทฯ&nbsp; จะใช้ความพยายามตามสมควรในการป้องกันไม่ให้เกิดกรณีดังกล่าว</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<strong><span style="font-size:14px">4. วิธีการชำระเงินและเงื่อนไข</span></strong></p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;4.1&nbsp; &nbsp; &nbsp;ผู้ใช้ตกลงชำระค่าบริการ และค่าใช้จ่ายตามรายการที่เกี่ยวข้อง (หากมี) ด้วยช่องทางที่ บริษัทฯ กำหนด</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;4.2&nbsp; &nbsp; &nbsp;หากผู้ใช้ปฏิเสธที่จะชำระค่าบริการ หรือค่าใช้จ่ายตามรายการที่เกี่ยวข้อง (หากมี) ที่ถึงกำหนดชำระ ผู้ใช้จะต้องดำเนินขั้นตอนการสั่งซื้อหรือขอใช้บริการใหม่ทั้งหมด</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;4.3&nbsp; &nbsp; &nbsp;ผู้ให้บริการสงวนสิทธิ์ที่จะติดต่อผู้ใช้ เพื่อดำเนินการที่จำเป็นเกี่ยวกับบริการ ซึ่งรวมถึงแต่ไม่จำกัดเพียงการเรียกเก็บเงินที่ค้างชำระอันเกิดขึ้นจากการใช้บริการ</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;4.4&nbsp; &nbsp; &nbsp;เมื่อค่าบริการ หรือค่าใช้จ่ายตามรายการที่เกี่ยวข้อง (หากมี) ได้ถูกจัดเก็บตามข้อกำหนดและเงื่อนไขเฉพาะของบริการแล้วจะไม่สามารถคืน และไม่สามารถแลกเปลี่ยนได้ เว้นแต่กรณีที่เป็นการกระทำผิด ฉ้อโกง หรือประมาทเลินเล่ออย่างร้ายแรงของผู้ให้บริการ ในกรณีดังกล่าว&nbsp; สถาบันการศึกษาหรือโรงเรียนกวดวิชา จะดำเนินการคืนเงินให้ผู้ใช้บริการในรูปแบบเครดิตหรือเงินสด สำหรับใช้งานบนแอปพลิเคชัน Smart School Management หลังจากที่ได้ผ่านขั้นตอนการตรวจสอบแล้วเสร็จ โดยบริษัทฯ ขอสงวนสิทธ์ในการไล่เบี้ยกับทางผู้ให้บริการหรือบุคคลอื่นที่เกี่ยวข้องเพื่อเรียกค่าเสียหายที่เกิดขึ้น</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;4.6&nbsp; &nbsp; &nbsp;ผู้ใช้ไม่ต้องจ่ายค่าตอบแทนพิเศษ หรือเงินตอบแทนพิเศษให้กับครูผู้สอน อย่างไรก็ตาม ผู้ใช้มีสิทธิที่จะจ่ายค่าตอบแทนพิเศษ หรือเงินตอบแทนพิเศษดังกล่าวได้ โดยชำระเป็นเงินสดโดยตรงให้กับผู้ให้บริการที่ให้บริการแก่ผู้ใช้ ซึ่งค่าตอบแทนพิเศษนี้ถือเป็นการให้โดยสมัครใจ และไม่เป็นส่วนหนึ่งของค่าบริการ</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<span style="font-size:14px"><strong>5. การจำกัดความรับผิด</strong></span></p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;5.1&nbsp; &nbsp; &nbsp;บริษัทฯ เป็นผู้ให้บริการแอปพลิเคชัน Smart School Management ซึ่งทำหน้าที่เป็นเพียงแค่แพลตฟอร์มด้านเทคโนโลยีสำหรับผู้ใช้เท่านั้น บริษัทฯ ไม่มีส่วนเกี่ยวข้องในการให้บริการ ทั้งนี้ผู้ให้บริการ (แล้วแต่กรณี) เป็นผู้ดำเนินการจัดการในการให้บริการทั้งหมด ดังนั้น ผู้ให้บริการเป็นผู้รับผิดชอบต่อความเสียหาย ข้อเรียกร้อง และความรับผิดใด ๆ ที่เกิดจากการดำเนินการให้บริการแต่เพียงฝ่ายเดียว</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;5.2&nbsp; &nbsp; &nbsp;ผู้ใช้รับรู้และยอมรับว่าความเสี่ยงทั้งหมดจากการใช้บริการของผู้ใช้นั้น เป็นความเสี่ยงของผู้ใช้ทั้งหมดแต่เพียงฝ่ายเดียว และผู้ใช้ไม่มีสิทธิไล่เบี้ยต่อบริษัทฯ ไม่ว่าในกรณีใด เว้นแต่ความสูญเสียหรือเสียหายนั้นเกิดจากการที่บริษัทฯ ฝ่าฝืนข้อกำหนดหลักเกี่ยวกับการบริการ การฉ้อโกง หรือความประมาทเลินเล่ออย่างร้ายแรงของบริษัทฯ เอง</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<span style="font-size:14px"><strong>6. การยกเลิก</strong></span></p>

<p>ผู้ใช้มีสิทธิยกเลิกคำสั่งในการใช้บริการ โดยอาจมีค่าธรรมเนียมการยกเลิก</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<strong><span style="font-size:14px">7. การชดใช้ค่าเสียหาย</span></strong></p>

<p>ผู้ใช้ตกลงที่จะปกป้อง ชดใช้ และปกป้องบริษัทฯ ให้ปลอดจากบรรดาข้อเรียกร้อง ค่าใช้จ่าย และค่าที่ปรึกษากฎหมายที่เกิดจาก (ก) การที่ผู้ใช้ฝ่าฝืนข้อกำหนดหลักเกี่ยวกับการบริการ (ข) การฉ้อโกง การกระทำผิด หรือการประมาทเลินเล่ออย่างร้ายแรงของผู้ใช้ (ค) การที่ผู้ใช้ใช้แอปพลิเคชัน Smart School Managementไปในทางที่ผิด และ (ง) การที่ผู้ใช้ละเมิดกฎหมาย หรือกฎเกณฑ์ที่เกี่ยวข้อง</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<span style="font-size:14px"><strong>8. บัญชีผู้ใช้</strong></span></p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;8.1&nbsp; &nbsp; &nbsp;ผู้ใช้จะต้องลงทะเบียน มีไว้ และรักษาไว้ซึ่งความปลอดภัย และความลับของบัญชีผู้ใช้ของตน ซึ่งรวมถึงแต่ไม่จำกัดเพียง การเก็บรักษาชื่อผู้ใช้และรหัสผ่านของผู้ใช้ไว้เป็นความลับ และไม่แบ่งปันข้อมูลส่วนตัวเกี่ยวกับบัญชีผู้ใช้ของผู้ใช้กับผู้อื่น ทั้งนี้ บริษัทฯ จะไม่รับผิดชอบ หรือรับผิดในความสูญเสียหรือเสียหายที่เกิดขึ้นไม่ว่าทางตรง หรือทางอ้อม ซึ่งเกิดขึ้น หรืออาจเกิดขึ้นจากการที่บุคคลอื่นใช้บัญชีผู้ใช้ของผู้ใช้ไม่ โดยไม่คำนึงว่าผู้ใช้จะทราบถึงการใช้ดังกล่าวหรือไม่</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;8.2&nbsp; &nbsp; &nbsp;บัญชีผู้ใช้ไม่สามารถโอนให้แก่ผู้อื่นได้</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;8.3&nbsp; &nbsp; &nbsp;บริษัทฯ สงวนสิทธิที่จะระงับชั่วคราว หรือถาวร และ/หรือ ยกเลิกบัญชีผู้ใช้ในเวลาใดก็ได้ ทั้งนี้ การฝ่าฝืนข้อกำหนดหลักเกี่ยวกับการบริการนี้ หรือ อาจนำไปสู่การระงับชั่วคราว และ/หรือ ยกเลิกบัญชีผู้ใช้ของผู้ใช้โดยบริษัทฯ</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<strong><span style="font-size:14px">9. กิจกรรมส่งเสริมการขาย</span></strong></p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;9.1&nbsp; &nbsp; โรงเรียนวรพัฒน์ อาจมีการออกรหัสโปรโมชันเนื่องในกิจกรรมใด ๆ ซึ่งอาจเป็นการ (1) แลกเปลี่ยนเป็นคะแนนในบัญชีผู้ใช้ซึ่งสามารถนำไปใช้สำหรับการทำคำสั่งในขณะนั้น หรือในอนาคตตามมูลค่าของคะแนนดังกล่าว หรืออาจนำไปใช้ในการชำระค่าบริการในครั้งเดียวสำหรับการทำคำสั่งในขณะนั้นหรือในอนาคต หรือ (2) ใช้เพื่อรับสิทธิประโยชน์จากบุคคลอื่นที่เป็นคู่ค้าทางธุรกิจกับโรงเรียนวรพัฒน์ โดยการใช้รหัสโปรโมชันนั้น ขึ้นอยู่กับข้อกำหนดและเงื่อนไขเพิ่มเติมที่โรงเรียนวรพัฒน์ กำหนดขึ้นสำหรับรหัสโปรโมชัน/กิจกรรมในแต่ละครั้ง หากผู้ใช้มีการใช้รหัสโปรโมชันในแอปพลิเคชัน Smart School Management ถือว่าผู้ใช้ได้รับรองและรับประกันว่าผู้ใช้ได้อ่าน และยอมรับตามข้อกำหนดและเงื่อนไขเพิ่มเติมก่อนที่จะดำเนินการส่งคำสั่งใช้บริการในแอปพลิเคชัน Smart School Management</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;9.2&nbsp; &nbsp; &nbsp;ผู้ใช้ตกลงยอมรับว่าผู้ใช้จะใช้รหัสโปรโมชันเพื่อวัตถุประสงค์เฉพาะตามที่ระบุไว้ในข้อกำหนดและเงื่อนไขเพิ่มเติมสำหรับรหัสโปรโมชัน/กิจกรรมในแต่ละครั้ง และจะใช้โดยชอบด้วยกฎหมาย</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;9.3&nbsp; &nbsp; &nbsp;รหัสโปรโมชัน หรือกิจกรรมต่าง ๆ อาจถูกโรงเรียนวรพัฒน์ ยกเลิก หรือปิดการใช้ ในเวลาใดก็ได้ไม่ว่าด้วยเหตุผลใดก็ตาม โดยที่บริษัทฯ ไม่มีความรับผิดใด ๆ</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;9.4&nbsp; &nbsp; &nbsp;รหัสโปรโมชัน หรือ กิจกรรมต่าง ๆ ไม่สามารถแลกเปลี่ยนเป็นเงินสดได้</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;9.5&nbsp; &nbsp; &nbsp;รหัสโปรโมชัน หรือ กิจกรรมต่าง ๆ อาจครบกำหนดระยะเวลาการใช้ก่อนที่ผู้ใช้จะได้ใช้</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;9.6&nbsp; &nbsp; &nbsp;โรงเรียนวรพัฒน์ สงวนสิทธิ์ที่จะหักคะแนนในบัญชีผู้ใช้ หรือสิทธิประโยชน์ที่ได้รับผ่านการใช้รหัสโปรโมชันในกรณีที่โรงเรียนวรพัฒน์ ค้นพบว่า หรือเชื่อว่าการใช้ หรือการนำรหัสโปรโมชันมาแลกเปลี่ยนมีข้อผิดพลาด เป็นการฉ้อโกง ผิดกฎหมาย หรือเป็นการฝ่าฝืนข้อกำหนดและเงื่อนไขของการใช้รหัสโปรโมชัน หรือกิจกรรมในแต่ละครั้ง</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<strong><span style="font-size:14px">10. การเข้าสู่เครือข่ายและอุปกรณ์</span></strong></p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;10.1&nbsp; &nbsp; ผู้ใช้มีหน้าที่จัดหามาซึ่งข้อมูล และ/หรือ การเข้าถึงเครือข่ายเพื่อใช้แอปพลิเคชัน Smart School Management โดยหากผู้ใช้ได้เข้าถึงและใช้งานแอปพลิเคชันSmart School Management บนโทรศัพท์เคลื่อนที่ของตนเอง ผู้ใช้จะต้องรับผิดชอบในค่าใช้จ่ายใด ๆ ที่เกี่ยวข้องจากผู้ให้บริการโทรคมนาคมของผู้ใช้ด้วย</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;10.2&nbsp; &nbsp; บริษัทฯ ไม่รับประกันว่าแอปพลิเคชัน Smart School Management จะทำงานได้อย่างถูกต้องเสมอไม่ว่าบนอุปกรณ์ประเภทใดก็ตาม</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;10.3&nbsp; &nbsp; แอปพลิเคชัน Smart School Management อาจไม่สามารถทำงานได้อย่างปกติ และ/หรือ มีความล่าช้าจากการใช้อินเตอร์เน็ต ความเร็วของอินเตอร์เน็ต และความหนาแน่นในระบบการติดต่อสื่อสารแบบอิเล็กทรอนิกส์ซึ่งรวมถึงกรณีที่อุปกรณ์ของผู้ใช้ หรือผู้ให้บริการเกิดความผิดพลาด ไม่มีการเชื่อมต่อ อยู่นอกเขตสัญญาณ ถูกปิด หรือไม่ทำงาน โดยบริษัทฯ จะไม่รับผิดชอบต่อความล่าช้า ความล้มเหลวในการจัดส่ง ความล้มเหลวของบริการ ความเสียหาย หรือความสูญเสียอันเป็นผลมาจากปัญหาดังกล่าว</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<strong><span style="font-size:14px">11. นโยบายคุ้มครองสิทธิความเป็นส่วนตัว</span></strong></p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;11.1&nbsp; &nbsp; &nbsp; โรงเรียนวรพัฒน์ ให้ความสำคัญแก่ความเป็นส่วนตัวของผู้ใช้แอปพลิเคชัน Smart School Management เป็นลำดับแรก</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;11.2&nbsp; &nbsp; &nbsp;โรงเรียนวรพัฒน์ สัญญาว่าจะคุ้มครองความเป็นส่วนตัวและข้อมูลส่วนบุคคลของผู้ใช้ของบริษัทฯ ตาม &quot;นโยบายคุ้มครองความเป็นส่วนตัวของโรงเรียนวรพัฒน์</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;11.3&nbsp; &nbsp; โรงเรียนวรพัฒน์ สัญญาที่จะใช้ความระมัดระวังและความใส่ใจอย่างสูงสุดเกี่ยวกับมาตรการรักษาความปลอดภัยของผู้ใช้แอปพลิเคชัน Smart School Management&nbsp; เพื่อให้มีการรักษาความปลอดภัยของข้อมูลใดๆ ของผู้ใช้ ทั้งหมด</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<span style="font-size:14px"><strong>12. ช่องทางติดต่อ</strong></span></p>

<p>หากผู้ใช้มีคำถามเกี่ยวกับข้อกำหนดหลักเกี่ยวกับการบริการ หรือปัญหาเกี่ยวกับการใช้แอปพลิเคชัน Smart School Management กรุณาติดต่อโรงเรียนวรพัฒน์ ตามที่อยู่อีเมล&nbsp;<strong>warraphat2561@gmail.com</strong></p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<span style="font-size:14px"><strong>13. การแก้ไขเปลี่ยนแปลง</strong></span></p>

<p>ข้อกำหนดหลักเกี่ยวกับการบริการ รวมทั้ง และนโยบายคุ้มครองสิทธิความเป็นส่วนตัวนี้อาจมีการแก้ไขเปลี่ยนแปลงเป็นครั้งคราว โดยจะมีการประกาศการแก้ไขเปลี่ยนแปลงบนแอปพลิเคชัน Smart School Management ซึ่งผู้ใช้จะต้องอ่านและยอมรับในการแก้ไขเปลี่ยนแปลงดังกล่าวก่อนที่ผู้ใช้จะสามารถใช้งานแอปพลิเคชัน Smart School Management ต่อไปเพื่อส่งคำสั่งในการใช้บริการ โดยการแจ้งเตือนการแก้ไขเปลี่ยนแปลงอาจเป็นการแจ้งเตือนผ่านกล่องแสดงข้อความที่ปรากฏขึ้น โดยหลังจากที่ผู้ใช้คลิกปุ่ม &quot;ฉันยอมรับ&quot; จะถือว่าเป็นการยอมรับการแก้ไขเปลี่ยนแปลงและเห็นชอบต่อข้อกำหนดหลักเกี่ยวกับการบริการ หรือ นโยบายคุ้มครองสิทธิความเป็นส่วนตัวที่ได้มีการแก้ไขแล้ว ทั้งนี้แล้วแต่กรณี</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<span style="font-size:14px"><strong>14. การแยกออกจากกัน</strong></span></p>

<p>หากข้อกำหนดใด ๆ ภายใต้ข้อกำหนดหลักเกี่ยวกับการบริการ หรือ นโยบายคุ้มครองสิทธิความเป็นส่วนตัว (แล้วแต่กรณี) ไม่สามารถใช้บังคับได้ ให้ถือว่าข้อกำหนดอื่น ๆ ที่เหลือของข้อกำหนดหลักเกี่ยวกับการบริการ หรือ นโยบายคุ้มครองสิทธิความเป็นส่วนตัว (แล้วแต่กรณี) ยังคงมีผลบังคับใช้อยู่อย่างสมบูรณ์</p>

<p>&nbsp;</p>

<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;<span style="font-size:14px"><strong>15. กฎหมายที่ใช้บังคับ</strong></span></p>

<p>ข้อกำหนดหลักเกี่ยวกับการบริการนี้ให้ใช้บังคับและตีความตามกฎหมายของประเทศไทย</p>

  </v-container>
</template>